# 問題21
    # 変数mに5を代入し、m = m+ 2 を代入演算子を用いてm を出力しなさい

m = 5
m += 2
print(m)

# 問題22
    # 変数nにパイソンを代入して変数nを出力する
    # さらにnを出力する

n = "パイソン"
print(n)
print("n")

# 問題23
    # 変数nにパイソンを代入して変数nを出力する
    # さらにPythonと上書きする
n = "パイソン"
print(n)
n = "Python"
print(n)

# 問題24
    #  3+7の結果をnに代入して出力
n = 3+7
print(n)

# 問題25
    #  xという変数に2を代入し、それを5倍した数を出力しなさい
x = 2
print(5*x)


# 問題26
    # 変数nに4を代入し、変数nを出力
    # nに5をかけて上書き
n = 4
print(n)
n *= 5
print(n)
  
# 問題27
    # 変数aに10を代入、変数bに20
    # 両社を入れ替える
a = 10
b = 20
a,b = b,a 
print(a,b)

# 問題28
    # 変数A,Bに一度に10,20を代入し出力
A,B = 10,20
print(A)
print(B)

# 問題29
    # 変数a=10, b=2
    # それぞれの四則演算を求めよ
a = 10 
b = 2

print(a+b,a-b,a*b,a/b)

# 問題30
    #  変数aに5,bに3を代入し、あまりを出力
a = 5
b = 3
print(a%b)