# 問題31
    # 変数aに2,bに5を代入し、aのb乗を計算
a = 2
b = 5
print(a**b)

# 問題32
    # 変数pに「東京」を代入
    # 私は東京を出身ですとpを用いて出力
p = "東京"
print("私は"+p+"出身です")

# 問題33
    # 変数pに東京を代入し、変数nに10+10を代入し、print関数で出力してください。
p = "東京"
n = 10 + 10
print("私は"+p+"出身です。"+ str(n) + "歳です。")

# 問題34
    # Hello と Worldの2つを連結させて出力
print("Hello,"+"World")

# 問題35
    # 掛け算を用いてhelloを10回出力
print("hello"*10)

# 問題36
    # 変数s="hello"に代入演算子を用いてhelloworldを出力
s ="hello"
s += "world"
print(s)
  
# 問題37
    # 変数s="hello"に代入演算子を用いてhelloを10回出力
s = "hello"
s *= 10
print(s)

# 問題38
    # 10+10のデータ型を出力しなさい。
print(type(10+10))

# 問題39
    # 文字列"123"を数値型に変換し出力
    # 文字列"456"を数値型に変換し出力
    # 文字列"123"と"456"を数値型に変換しその和を出力
a = "123"
b = "456"
print(int(a))
print(int(b))
print(int(a)+int(b))

# 問題40
    # 数字"123"を文字列に変換し出力
    # 数字"456"を文字列に変換し出力
    # 数字"123"と"456"を文字列に変換しその和を出力
a = 123
b = 456
print(str(a))
print(str(b))
print(str(a)+str(b))